Tekla Open API Reference for Tekla Structures 2025
PlacingTypes Class
 The PlacingTypes class defines the different available placing types. Please note that not all objects accept all types. If you try to use the wrong type it will not be accepted (Insert, Modify will fail).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PlacingTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class PlacingTypes
Public NotInheritable Class PlacingTypes
The PlacingTypes type exposes the following members.
Methods
Name | Description
AlongLinePlacing
 The object is located and moved along a line defined by two points.
BaseLinePlacing
 The object is placed using a line as a reference. This will thus define the object's X-axis along that line.
LeaderLinePlacing
 The object is placed attached to a leader line.
PointPlacing
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace